
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/paaaaay5/spajam-kumamoto-infra/actions/runs/5913802580)



<pre><code>Apply complete! Resources: 2 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto]
data.aws_iam_policy_document.ecs_task_ssm_permissions: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=spajam-kumamoto]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/spajam-kumamoto]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0920cf11de1d92ae7]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_ssm_permissions: Read complete after 0s [id=2402476764]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_iam_role.ecs: Refreshing state... [id=spajam-kumamoto-ecs]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_iam_role.ecs_task: Refreshing state... [id=spajam-kumamoto-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Refreshing state... [id=spajam-kumamoto-ecs-20230819095939639700000001]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=spajam-kumamoto]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=spajam-kumamoto]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0eecff860f55c3dbf]
aws_security_group.ecs: Refreshing state... [id=sg-0dc2c22c8f9803a2b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b8323f32e0188caa]
aws_security_group.alb: Refreshing state... [id=sg-006a300025ac1d319]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:targetgroup/spajam-kumamoto-target-group/d25116fba60160cb]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d4d2a3868b8756e3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d4c072cf3a97bd7b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09d14dd6c5b0622d8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0cff95b879bc90e4f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0eca56afc73dbc04d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d761cebf631b1e28]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08247e53abe7d6ec1]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a7eff22dee3d9923]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2488100056]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d5c65de60dc43411]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-066c2a8bb44c7a564]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063e77b57ee24b52d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09d14dd6c5b0622d81080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-018b92e856c13a8a0]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02f78b82ffb805bf5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00387ad316b7e0197]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:loadbalancer/app/spajam-kumamoto-alb/6166d7a80543c031]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0af27f6a28024e827]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b772a1aaf44d7751]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-076091a4fd765c0f6]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0eca56afc73dbc04d1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d761cebf631b1e281080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:listener/app/spajam-kumamoto-alb/6166d7a80543c031/fc919910f23067e3]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:listener-rule/app/spajam-kumamoto-alb/6166d7a80543c031/fc919910f23067e3/8e7ce6e15ad583b2]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:774848854882:service/spajam-kumamoto/spajam-kumamoto]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_cluster.ecs_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs_cluster" {
        id       = "arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto"
        name     = "spajam-kumamoto"
      ~ tags     = {
          - "AWS.SSM.AppManager.ECS.Cluster.ARN" = "arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto" -> null
        }
      ~ tags_all = {
          - "AWS.SSM.AppManager.ECS.Cluster.ARN" = "arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:774848854882:service/spajam-kumamoto/spajam-kumamoto"
        name                               = "spajam-kumamoto"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:774848854882:task-definition/spajam-kumamoto:2" -> "arn:aws:ecs:ap-northeast-1:774848854882:task-definition/spajam-kumamoto:1"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_policy.ecs_task_ssm will be created
  + resource "aws_iam_policy" "ecs_task_ssm" {
      + arn         = (known after apply)
      + description = "Permission for ECS tasks to pull from SSM"
      + id          = (known after apply)
      + name        = "spajam-kumamoto-ecs-task-ssm"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_ssm_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_ssm_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "spajam-kumamoto-ecs-task"
    }

Plan: 2 to add, 2 to change, 0 to destroy.
aws_iam_policy.ecs_task_ssm: Creating...
aws_ecs_cluster.ecs_cluster: Modifying... [id=arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto]
aws_iam_policy.ecs_task_ssm: Creation complete after 1s [id=arn:aws:iam::774848854882:policy/spajam-kumamoto-ecs-task-ssm]
aws_iam_role_policy_attachment.ecs_task_ssm_attachment: Creating...
aws_iam_role_policy_attachment.ecs_task_ssm_attachment: Creation complete after 0s [id=spajam-kumamoto-ecs-task-20230819222007755000000001]
aws_ecs_cluster.ecs_cluster: Modifications complete after 1s [id=arn:aws:ecs:ap-northeast-1:774848854882:cluster/spajam-kumamoto]
aws_ecs_service.ecs_service: Modifying... [id=arn:aws:ecs:ap-northeast-1:774848854882:service/spajam-kumamoto/spajam-kumamoto]
aws_ecs_service.ecs_service: Modifications complete after 1s [id=arn:aws:ecs:ap-northeast-1:774848854882:service/spajam-kumamoto/spajam-kumamoto]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 2 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"837458ef0c458300c49929c88c8f8f12d1e44f30","Vars":{},"WorkflowName":"Terraform-CICD"} -->